In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 1. display Top 3 rows of the dataset

In [12]:
df[0:3]

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [13]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# 2.Check last 3 rows of dataset

In [17]:
df[-3:]

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [18]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 3. Find Shape of our dataset(No of rows and columns)

In [21]:
df.shape

(7, 3)

In [23]:
print("Number of rows", df.shape[0])
print("Number of columns", df.shape[1])

Number of rows 7
Number of columns 3

# 4.Get information about our dataset like total no of rows, total no of columns, Datatype of each columns, and memory rtequirements

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

# 5.Check null values in the dataset

In [31]:
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

# 6.Get overall statics about our dataframe

In [32]:
df.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

## for all values including catagorical

In [34]:
df.describe(include="all")

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

# 7.Unique values for gender column

In [35]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

# 8.Find the number of unique values from Gender column

In [36]:
df['Gender'].nunique()

2

# 9. Display count of unique values in the gender column

In [39]:
df['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

# 10. Find total number of student having marks 90 to 100 (inclusive) using Between method

In [41]:
len(df[df['Marks']>=90])

4

In [44]:
sum(df['Marks'].between(90,100))

4

# 11. Find average marks

In [47]:
(df['Marks'].sum()/len(df['Marks']))

92.14285714285714

In [49]:
df['Marks'].mean()

92.14285714285714

# 12. Apply Method

In [55]:
def percent(x):
    return x

In [57]:
df["Percent"] = df['Marks'].apply(percent)

In [58]:
df

      Name  Marks  Gender  Percent
0  Priyang     98    Male       98
1   Aadhya     89  Female       89
2   Krisha     99  Female       99
3   Vedant     87    Male       87
4   Parshv     90    Male       90
5   Mittal     83  Female       83
6  Archana     99  Female       99

In [59]:
df['Half_number']=df['Marks'].apply(lambda x:x/2)

In [60]:
df

      Name  Marks  Gender  Percent  Half_number
0  Priyang     98    Male       98         49.0
1   Aadhya     89  Female       89         44.5
2   Krisha     99  Female       99         49.5
3   Vedant     87    Male       87         43.5
4   Parshv     90    Male       90         45.0
5   Mittal     83  Female       83         41.5
6  Archana     99  Female       99         49.5

# 13. Map Function

In [61]:
df['abbreviation']= df['Gender'].map({'Male':'M', 'Female':'F'})

In [62]:
df

      Name  Marks  Gender  Percent  Half_number abbreviation
0  Priyang     98    Male       98         49.0            M
1   Aadhya     89  Female       89         44.5            F
2   Krisha     99  Female       99         49.5            F
3   Vedant     87    Male       87         43.5            M
4   Parshv     90    Male       90         45.0            M
5   Mittal     83  Female       83         41.5            F
6  Archana     99  Female       99         49.5            F

# 14. Drop the columns

In [64]:
df.drop('abbreviation', axis=1)

      Name  Marks  Gender  Percent  Half_number
0  Priyang     98    Male       98         49.0
1   Aadhya     89  Female       89         44.5
2   Krisha     99  Female       99         49.5
3   Vedant     87    Male       87         43.5
4   Parshv     90    Male       90         45.0
5   Mittal     83  Female       83         41.5
6  Archana     99  Female       99         49.5

In [67]:
df.drop(['abbreviation', 'Half_number', 'Percent'], axis=1, inplace=True)

In [68]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 15. Print Name of the columns

In [69]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [70]:
df.index

RangeIndex(start=0, stop=7, step=1)

# 16. Sort the dataframe as per marks column

In [74]:
df.sort_values(by='Marks', ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

# 17. Display name and marks of the female students

In [76]:
df[df["Gender"]=="Female"][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [81]:
df[df['Gender'].isin(['Female'])][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99